{"id":717,"date":"2022-12-29T12:18:47","date_gmt":"2022-12-29T08:48:47","guid":{"rendered":"https:\/\/vahidbaghi.ir\/blog\/?p=717"},"modified":"2024-06-28T12:56:03","modified_gmt":"2024-06-28T09:26:03","slug":"%db%b2-%da%86%d8%a7%d9%84%d8%b4-%d8%af%d8%a7%d9%86%db%8c%d9%84%d8%a7-%d8%a8%d8%a7-%d8%aa%d8%a7%d8%a8%d8%b9-relu","status":"publish","type":"post","link":"https:\/\/127.0.0.1\/blog\/?p=717","title":{"rendered":"۲. چالش دانیلا با تابع ReLU!"},"content":{"rendered":"\n<p>دانیلا می‌دونه که اگر تابع فعال‌سازی (activation function) بعضی از لایه های مدلش رو به ReLU تغییر بده، می‌تونه باعث بهبود مدلش بشه. متاسفانه تیمی که دانیلا داخلش کار می‌کنه در برابر تغییرات مقاومت نشون میدن! بنابراین بهترین کاری که می‌تونه انجام بده اینه که یه لیستی از مزایای تابع ReLU آماده کنه و به تیم ارائه بده تا نظرشون رو تغییر بده. اون یه پیش‌نویسی رو از قبل آماده کرده و نمی‌دونه کدومش بهتره و نیاز به کمک شما داره!<\/p>\n\n\n\n<p>کدوم یکی از عبارت های زیر مزایای تابع ReLU رو نشون میده؟<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>تابع ReLU در اطراف مقادیر حدی (اکستریم) اشباع میشه که به عملیات پس‌انتشار (backpropagation) اجازه میده سریعتر همگرا بشه و به یادگیری شبکه کمک می‌کنه.<\/li>\n\n\n\n<li>تابع ReLU نمایش پراکندگی (representational sparsity) بهتری نسبت به توابع فعال‌سازی sigmoid و tanh داره چون خروجی تابع برای مقادیر کوچکتر یا مساوی صفر دقیقا صفره.<\/li>\n\n\n\n<li>تابع ReLU پیاده سازی ساده‌ای داره<\/li>\n\n\n\n<li>زمانی که شبکه های عصبی تا جای ممکن رفتار خطی داشته باشند، ساده‌تر می‌تونن خودشون رو بهینه (optimize) کنند. تابع ReLU که عمدتا به صورت یک تابع خطی عمل میکنه می‌تونه در بهینه کردن شبکه های عصبی به ما کمک کنه.<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<p>پاسخ کوتاه : گزینه ۲ و ۳ و ۴<\/p>\n\n\n\n<p>پاسخ بلند : اول بیاید یه یادآوری از تابع ReLU داشته باشیم. اگر ورودی این تابع مقداری کمتر از ۰ (صفر) باشه خروجی تابع ۰ (صفر) میشه و در غیر این صورت همون مقداری که به عنوان ورودی گرفته رو به خروجی انتقال میده :<\/p>\n\n\n\n<p class=\"has-text-align-center\">f(x) = max(x,0)<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"768\" src=\"https:\/\/127.0.0.1\/blog\/wp-content\/uploads\/2024\/06\/Plot-of-Inputs-vs-Outputs-for-the-ReLU-Activation-Function.-1024x768.png\" alt=\"\" class=\"wp-image-711\"\/><\/figure>\n\n\n\n<p>بیاید گزینه اول رو بررسی کنیم. ابتدا می‌خوام اصطلاحاتی که در این گزینه وجود داره رو تعریف کنم.<\/p>\n\n\n\n<p><strong>مقادیر اکستریم :<\/strong> به زبون آدمیزاد یعنی کوچکترین و بزرگترین مقدار تابع! برای ReLU کوچکترین مقدار صفره و بزرگترین مقدار نداره! یعنی کران بالا نداره! برای تابع sigmoid کوچکترین و بزرگترین مقدار ۰ و ۱ است. برای tanh کوچکترین و بزرگترین مقدار ۱- و ۱ است.<\/p>\n\n\n\n<p><strong>اشباع شدن :<\/strong> وقتی می‌گیم خروجی یه تابع اشباع (saturate) میشه به زبون آدمیزاد یعنی منحنی تابع موازی محور x ها میشه! مثلا منحنی تابع sigmoid رو در نظر بگیرید :<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"682\" src=\"https:\/\/127.0.0.1\/blog\/wp-content\/uploads\/2024\/06\/1280px-Logistic-curve.svg_-1024x682.png\" alt=\"\" class=\"wp-image-715\"\/><\/figure>\n\n\n\n<p>اگر ورودی تابع یه عدد منفی یا مثبت بزرگ باشه، خروجی تابع sigmoid اشباع (saturate) میشه! اما تابع ReLU برای مقادیر منفی اشتباع میشه ولی برای مقادیر مثبت اشباع نمیشه. چون کران بالا نداره. یعنی هیچ وقت منحنی تابع ReLU برای مقادیر مثبت موازی محور x ها نمیشه!<\/p>\n\n\n\n<p>پس چی شد؟ گزینه اول داره میگه تابع ReLU در اطراف مقادیر حدی (اکستریم) اشباع میشه که غلطه! فقط برای مقادیر منفی اشباع میشه! همین کافیه که این گزینه رو رد کنیم ولی بیاید ادامه رو هم بررسی کنیم. در ادامه میگه این قضیه باعث میشه عملیات پس‌انتشار سریعتر همگرا بشه! داستان دقیقا برعکسه! Saturation برای شبکه های عصبی یه قضیه مشکل سازه! باعث مشکلاتی نظیر <a rel=\"noreferrer noopener\" href=\"https:\/\/machinelearningmastery.com\/how-to-fix-vanishing-gradients-using-the-rectified-linear-activation-function\/\" target=\"_blank\">محوشدگی گرادیان (Vanishing Gradient)<\/a> و <a rel=\"noreferrer noopener\" href=\"https:\/\/arxiv.org\/abs\/1903.06733\" target=\"_blank\">Dying ReLU<\/a> میشه!<\/p>\n\n\n\n<p>مشکل محوشدگی گرادیان چیه؟ <a href=\"http:\/\/cafetadris.com\/blog\/%D9%85%D8%AD%D9%88%D8%B4%D8%AF%DA%AF%DB%8C-%DA%AF%D8%B1%D8%A7%D8%AF%DB%8C%D8%A7%D9%86-vanishing-gradient\/\" target=\"_blank\" rel=\"noreferrer noopener\">این لینک<\/a> خیلی خوب توضیح داده که به صورت خلاصه میشه :<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<h3 class=\"wp-block-heading\">چرا مشکل محوشدگی گرادیان (Vanishing Gradient) اتفاق می‌افتد؟<\/h3>\n\n\n\n<p>برخی توابع فعال‌ساز، مانند تابع سیگموید (Sigmoid)، مقادیر ورودی با مقیاس بزرگ را در یک بازه‌ی کوچک میان صفر و 1 قرار می‌دهند؛ بنابراین زمانی‌که یک تغییر بسیار بزرگ در مقدار ورودی تابع اتفاق می‌افتد، خروجی تابع تنها مقدار کمی تغییر می‌کند؛ این یعنی مقدار مشتق آن خیلی کوچک می‌شود.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"840\" height=\"470\" src=\"https:\/\/127.0.0.1\/blog\/wp-content\/uploads\/2024\/06\/تابع-سیگموید-و-مشتق-آن.jpg\" alt=\"\" class=\"wp-image-719\"\/><\/figure>\n\n\n\n<p>برای مثال، در شکل بالا تابع سیگموید را به‌همراه مشتق آن مشاهده می‌کنیم. همان‌طور که می‌بینیم زمانی‌که مقدار ورودی تابع بزرگ یا کوچک می‌شود، مقدار مشتق آن به صفر نزدیک می‌شود.<\/p>\n<\/blockquote>\n\n\n\n<p>پس گزینه اول کلا غلطه! حالا بریم سراغ گزینه دوم. داره در مورد مفهومی به نامrepresentational sparsity صحبت می‌کنه. خب این یعنی چی؟ یکی از مزایای تابع ReLU اینه که خروجیش برای مقادیر منفی دقیقا صفره. در صورتی که sigmoid و tanh در فرآیند learing تقریبی از صفر رو نمایش می‌دن. یعنی خروجیشون خیلی نزدیک به صفره ولی واقعا صفر نیست!<\/p>\n\n\n\n<p>بنابراین زمانی که از تابع ReLU در لایه های میانی (hidden layer) استفاده می‌کنیم باعث میشه بعضی از نورون ها مقدارشون صفر بشه! یعنی یه چیزی مثل تصویر زیر میشه :<\/p>\n\n\n\n<p> <\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"602\" height=\"431\" src=\"https:\/\/127.0.0.1\/blog\/wp-content\/uploads\/2024\/06\/main-qimg-2e5813c21a3dbf164b1ff02190e0acba-pjlq.jpg\" alt=\"\" class=\"wp-image-722\"\/><\/figure>\n\n\n\n<p>در واقع برخی از نورون ها غیر فعال میشن چون وزنشون صفره! این باعث میشه مدل ساده‌تری داشته باشیم و هزینه محاسباتی هم کمتر بشه و احتمال <a rel=\"noreferrer noopener\" href=\"http:\/\/cafetadris.com\/blog\/%D8%A8%DB%8C%D8%B4-%D8%A8%D8%B1%D8%A7%D8%B2%D8%B4-overfitting\/\" target=\"_blank\">overfitting <\/a>هم کمتر بشه! اگر بخوام به زبان کوچه بازاری بگم، اینکه همه نورون ها در فرآیند learning همکاری داشته باشن می‌دونید مثل چی می‌مونه؟ مثل شخصی می‌مونه که همه کاره و هیچ کاره است! کسی که از هر کاری یه ذره بلده (دریایی به عمق یک سانتی‌متر) بهتره یا کسی که توی یه کار تخصص داره؟ در مورد نورون ها هم همینه. اصلا یه تکنیکی در شبکه های عصبی وجود داره به نام <a rel=\"noreferrer noopener\" href=\"https:\/\/howsam.org\/dropout-neural-network\/\" target=\"_blank\">Dropout <\/a>که ما عامدانه یکسری نورون ها رو به صورت رندوم حذف می‌کنیم! در واقع ReLU یه جور Dropout طبیعی داره.<\/p>\n\n\n\n<p>اما این قضیه در تابع ReLU یک شمشیر دو لبه است. یعنی می‌تونه باعث مشکل dying ReLU (<a rel=\"noreferrer noopener\" href=\"https:\/\/towardsdatascience.com\/neural-network-the-dead-neuron-eaa92e575748\" target=\"_blank\">این مقاله<\/a> رو هم در موردش بخونید) بشه. یه دفعه می‌بینی فرار مغز ها زیاد شد و کلا ۴ تا نورون نخاله توی شبکه موندن و شبکه به فاک رفت! خب این راه حل داره. می‌تونیم <a rel=\"noreferrer noopener\" href=\"https:\/\/machinelearningmastery.com\/understand-the-dynamics-of-learning-rate-on-deep-learning-neural-networks\/\" target=\"_blank\">learning rate<\/a> رو کوچیکتر در نظر بگیریم که یه دفعه یه وزن منفی بزرگ نداشته باشیم که کلی از نورون ها صفر بشن یا می‌تونیم از تابع Leaky ReLU استفاده کنیم. پس گزینه دوم با اینکه کلی اما و اگر داشت ولی درسته!<\/p>\n\n\n\n<p>گزینه سوم هم درسته. چون پیاده سازی ReLU بر خلاف sigmoid و tanh که هزینه محاسباتی (به توان رسوندن) بیشتری دارند، خیلی ساده تره.<\/p>\n\n\n\n<p>در مورد گزینه چهارم، اول توضیحات زیر رو از <a rel=\"noreferrer noopener\" href=\"http:\/\/cafetadris.com\/blog\/%D8%AA%D9%88%D8%A7%D8%A8%D8%B9-%D9%81%D8%B9%D8%A7%D9%84%D8%B3%D8%A7%D8%B2-activation-functions\/\" target=\"_blank\">این لینک<\/a> بخونید :<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>اگر از توابع فعالساز (<a rel=\"noreferrer noopener\" href=\"https:\/\/medium.com\/@snaily16\/what-why-and-which-activation-functions-b2bf748c0441\" target=\"_blank\">Activation Functions<\/a>) استفاده نکنیم، وزن‌ها و مقدار بایاس فقط یک معادله‌ی خطی را ایجاد می‌کنند. درست است که معادله‌ی خطی خیلی راحت‌تر حل‌شدنی است، اما برای حل مسائل پیچیده نمی‌تواند کمکی به ما کند؛ درواقع معادلات خطی در یادگیری الگوهای پیچیده‌ی داده‌ی خیلی محدود هستند و یک شبکه‌ی عصبی بدون تابع فعال‌ساز فقط یک مدل رگرسیون خطی (Linear Regression Model) است. به‌طور کلی، شبکه‌های عصبی از توابع فعالساز استفاده می‌کنند تا بتوانند به شبکه در یادگیری داده‌های پیچیده کمک و پیش‌بینی قابل‌قبولی را در خروجی ارائه کنند.<\/p>\n<\/blockquote>\n\n\n\n<p>پس اگر توابع ما خطی باشند شبکه عصبی خیلی ساده‌تر می‌تونه optimize بشه ولی این به این معنی نیست که می‌تونه یک مدل خوبی هم بسازه! اما نکته اینه که تابع ReLU یک تابع خطی نیست! در واقع یک <a rel=\"noreferrer noopener\" href=\"https:\/\/fa.wikipedia.org\/wiki\/%D8%AA%D8%A7%D8%A8%D8%B9_%D8%AA%DA%A9%D9%87%E2%80%8C%D8%A7%DB%8C_%D8%AE%D8%B7%DB%8C\" target=\"_blank\">تابع تکه‌ای خطی<\/a> (piecewise linear function) محسوب میشه که تعریف به زبان خیلی ساده میشه :<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>تابعی پیوسته بر [a,b] که نمودار آن از تعدادی متناهی قطعه‌خط تشکیل شده است<\/p>\n<cite>https:\/\/lamtakam.com\/dictionaries\/farhangestan\/8561\/%D8%AA%D8%A7%D8%A8%D8%B9+%D8%AA%DA%A9%D9%87+%D8%A7%DB%8C+%D8%AE%D8%B7%DB%8C<\/cite><\/blockquote>\n\n\n\n<p>خب این باعث میشه ReLU ویژگی های مدل های خطی رو داشته باشه و در عین حال خطی نباشه. توصیه می‌کنم حتما ویدئو زیر رو ببینید که زندگیتون رو در زمینه درک توابع فعال‌سازی متحول میکنه! <\/p>\n\n\n\n<p class=\"has-text-align-center\"><a href=\"https:\/\/www.youtube.com\/watch?v=Ijqkc7OLenI\">https:\/\/www.youtube.com\/watch?v=Ijqkc7OLenI<\/a><\/p>\n\n\n\n<p>پس در نتیجه گزینه های ۲ و ۳ و ۴ صحیح هستند!<\/p>\n\n\n\n<p>برای دونیت می‌تونید از لینک های زیر استفاده کنید :<\/p>\n\n\n\n<p class=\"has-text-align-left\"><a href=\"https:\/\/www.coffeete.ir\/vahidbaghi\">https:\/\/www.coffeete.ir\/vahidbaghi<\/a><\/p>\n\n\n\n<p class=\"has-text-align-left\"><a href=\"https:\/\/vahidbaghi.gumroad.com\/l\/chdsa\">https:\/\/vahidbaghi.gumroad.com\/l\/chdsa<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>دانیلا می‌دونه که اگر تابع فعال‌سازی (activation function) بعضی از لایه های مدلش رو به ReLU تغییر بده، می‌تونه باعث بهبود مدلش بشه. متاسفانه تیمی&#8230;<\/p>\n","protected":false},"author":1,"featured_media":725,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[41],"tags":[],"class_list":["post-717","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-41"],"_links":{"self":[{"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/posts\/717"}],"collection":[{"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/comments?post=717"}],"version-history":[{"count":6,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/posts\/717\/revisions"}],"predecessor-version":[{"id":1511,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/posts\/717\/revisions\/1511"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/media\/725"}],"wp:attachment":[{"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/media?parent=717"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/categories?post=717"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/tags?post=717"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}