{"id":887,"date":"2023-09-05T15:02:58","date_gmt":"2023-09-05T11:32:58","guid":{"rendered":"https:\/\/vahidbaghi.ir\/blog\/?p=887"},"modified":"2024-06-28T12:53:43","modified_gmt":"2024-06-28T09:23:43","slug":"%da%86%d8%b1%d8%a7-%d8%a2%d9%85%d9%88%d8%b2%d8%b4-%d8%a8%d8%b1%d9%86%d8%a7%d9%85%d9%87%d9%86%d9%88%db%8c%d8%b3%db%8c-%d8%aa%d9%88%d9%84%db%8c%d8%af-%da%a9%d8%b1%d8%af%d9%85%d8%9f-%d8%a7","status":"publish","type":"post","link":"https:\/\/127.0.0.1\/blog\/?p=887","title":{"rendered":"چرا آموزش برنامه‌نویسی تولید کردم؟ (+ انتشار رایگان آموزش جاوا)"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"843\" height=\"479\" src=\"https:\/\/127.0.0.1\/blog\/wp-content\/uploads\/2024\/06\/1_Untitled-1.png\" alt=\"\" class=\"wp-image-891\"\/><\/figure>\n\n\n\n<p>من ضبط فیلم های آموزشی رو از سال سوم دبیرستان شروع کردم. یکی از آشناها گیر داده بود که بیا به من کار با کامپیوتر رو یاد بده. میخواست کار های خیلی ساده رو بتونه انجام بده. در حد کار های اداری روتین مثل پرینت گرفتن و نصب برنامه و از این قبیل کار ها. حجم مطالب پکیج های آموزشی موجود در بازار هم زیاد بود. این نمی‌خواست ICDL یاد بگیره. منم راستش حوصله نداشتم و امتحان نهایی هم داشتم و اینم ول نمی‌کرد. منم گفتم بذار فیلم آموزشی ضبط می‌کنم و همون نکات کاربردی رو برات توضیح می‌دم. اینجا بود که اولین فیلم آموزشی خودم رو ضبط کردم.<\/p>\n\n\n\n<p>سال ۹۲ که وارد دانشگاه شدم با سایت <a href=\"https:\/\/www.daneshjooyar.com\/\">دانشجویار<\/a> آشنا شدم. دانشجویار اون موقع تازه تاسیس بود و تعداد مدرسینش خیلی کم بود. منم اون موقع تازه سی‌شارپ رو داشتم یاد می‌گرفتم و تو اوج قله حماقت نمودار دانینگ کروگر بودم! بهشون ایمیل زدم که من دوست دارم به عنوان مدرس توی سایتتون آموزش بذارم. یه نمونه آموزش هم براشون فرستادم و پذیرفته شدم.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"768\" height=\"691\" src=\"https:\/\/127.0.0.1\/blog\/wp-content\/uploads\/2024\/06\/dunning-kruger-effect-768x691.png.webp\" alt=\"\" class=\"wp-image-888\"\/><\/figure>\n\n\n\n<p>فیلمی که به عنوان نمونه براشون فرستادم نحوه ساخت AutoComplete توی سی‌شارپ بود که یه متنی رو که تایپ می‌کردی، ادامه رو پیشنهاد می‌داد. برنامه این بود :<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"488\" height=\"340\" src=\"https:\/\/127.0.0.1\/blog\/wp-content\/uploads\/2024\/06\/2_Untitled.png\" alt=\"\" class=\"wp-image-890\"\/><\/figure><\/div>\n\n\n<p>کارم این شده بود که می‌رفتم تو سایت <a href=\"https:\/\/www.codeproject.com\">CodeProject <\/a>و سورس یه برنامه جالبی که به چشمم می‌خورد رو دانلود می‌کردم و کدش رو می‌خوندم و بعد فیلم آموزشیش رو ضبط می‌کردم و توی دانشجویار میذاشتم. همه آموزش ها هم رایگان توی سایت قرار می‌گرفت ولی من یه مبلغ کمی از مدیر سایت دریافت می‌کردم. توی اون آموزش ها سوتی هم زیاد دادم که طبیعی بود اما حداقل برنامه کار می‌کرد 🙂<\/p>\n\n\n\n<p>نظر شخصی من اینه که کسی که یه مبحثی رو خوب تدریس می‌کنه دلیل نمیشه که در عمل هم توی اون مبحث خوب باشه و برعکس، کسی که یه مبحثی رو در عمل خوب بلده دلیل نمیشه که بتونه خوب هم تدریس کنه. به خصوص تو حوزه برنامه نویسی این موضوع خیلی مشهوده. من اون آدمه بودم که در عمل خوب نبود، نحوه تدریسش هم ضعیف بود. البته به مرور داشتم بهتر می‌شدم.<\/p>\n\n\n\n<p>یه مدت که گذشت مدیر سایت http:\/\/w3-farsi.com به من ایمیل زدند که بیا با هم همکاری داشته باشیم. دورانی رو تصور کنید که بهترین کتاب های فارسی برای برنامه نویسی کتاب های جعفرنژاد قمی بودند. کتاب های دیگه هم به همون افتضاحی جعفرنژاد قمی بودند. توی این دوران، چنین کتاب های فوق العاده‌ای رو نوشته بودند. نثرش به شدت ساده و روان بود. به نظرم هنوز هم بهترین کتاب های فارسی حوزه برنامه‌نویسی محسوب میشه. گفتند بیا از روی کتاب سی‌شارپ، ویدئو ضبط کن. دیگه نیاز نیست دنبال جمع کردن سرفصل باشی یا بخوای فکر کنی که چی بگی.<\/p>\n\n\n\n<p>منم قبول کردم و کل تابستون طول کشید که آموزش رو ضبط کنم. فن بیانم نسبت به آموزش های قبلی که ضبط کرده بودم بهتر شده بود. اما بازم به نظرم قابل قبول نبود. لحن صحبت میتونست بهتر باشه. با وجود اینکه خیلی از آموزش استقبال شده بود ولی من بخش هایی که به نظرم فن بیان خوبی نداشتم یا نتونسته بودم مفهوم رو به خوبی منتقل کنم رو دوباره ضبط کردم. حتی تفاوت فن بیانم بین قسمت های اول آموزش و قسمت های آخر آموزش کاملا مشهود بود. هر چند وقت یکبار هم به خریداران ایمیل می‌زدم و نظرشون رو می‌پرسیدم. ۹۰ درصد راضی بودند. ۱۰ قسمت اول رو هم رایگان گذاشته بودم و به شدت تاکید داشتم که قبل از خرید ۱۰ قسمت مقدماتی رو ببینن، اگر راضی بودن آموزش رو بخرن. خیلی روی این موضوع تاکید داشتم. چون نمی‌خواستم طرف آموزش رو بخره بعد ببینه از مدل تدریس خوشش نمیاد و ناراضی بشه. روی سرفصل هم خیلی تاکید داشتم. همیشه میگفتم اگر دنبال مبحث خاصی هستید سرفصل ها رو نگاه کنید یا کامنت بذارید و بپرسید. البته اینجوری هم نبود که همه چیز بی‌نقص باشه و هیچ کسی هم ناراضی نباشه. افرادی بودند که ناراضی بودند ولی تعداد افراد راضی خیلی بیشتر بود. در کل شما هیچ وقت نمی‌تونید همه رو راضی نگه دارید.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1024\" height=\"576\" src=\"https:\/\/127.0.0.1\/blog\/wp-content\/uploads\/2024\/06\/Logo2-1024x576.png\" alt=\"\" class=\"wp-image-892\"\/><\/figure>\n\n\n\n<p>گذشت و دیدیم که آموزش سی‌شارپ خوب دراومد، پیشنهاد دادند که آموزش جاوا رو هم ضبط کنم. من از اشتباهاتی که تو ضبط آموزش سی‌شارپ داشتم درس های خوبی گرفته بودم. توی ضبط آموزش دیگه عجله نکردم. گفتم ۶ ماه هم طول بکشه مهم نیست. به جاش کیفیت خوب باشه. خیلی از جاها فراتر از کتاب توضیح دادم. یعنی هر مبحثی که میخواستم فیلمش رو ضبط کنم قبلش چندین رفرنس رو می‌خوندم که یه موقع چیزی رو اشتباه نگم. میکروفون حرفه‌ای هم خریده بودم. روز اولی که آموزش رو منتشر کردم ترکوند! یعنی خیلی استقبال شد. آموزش جاوا رقیب رایگان و پولی زیاد داشت. اما یه چیزی که اونا نداشتند حل تمرین و  پروژه بود. این آموزش جای خودش رو بین دانشجو ها پیدا کرد. دانشجو هدفش چیه؟ پاس کردن درس. وجود حل تمرین توی آموزش باعث شد قشر دانشجو جذب آموزش بشه. البته این قضیه نکته منفی هم بود. دانشجو جماعت پول نمیده. عموما یه نفر که میخره یه بقیه هم میده. نکته بامزه هم اینه که یه دفعه یکی از دوستانم تعریف می‌کرد که رفیقش بهش گفته آره می‌خوای جاوا یاد بگیری یه آموزش دارم خیلی خوبه. بعد که براش روی فلش ریخته دیده آموزش منه :))))<\/p>\n\n\n\n<p>دلیل اینکه آموزش جاوا رو رایگان تو یوتیوب گذاشتم اینه که خیلی ساله گذشته و من هم دیگه قرار نیست آموزش ها رو آپدیت کنم. فروش آموزش به طور کلی خیلی کم شده ولی زمانی که یه تخفیف خیلی خوب (مثلا ۹۰ درصد) می‌خوره افراد زیادی میان می‌خرن. این نشون میده خواهان داره ولی قیمت آموزش بالاست که واقعا دست من هم نیست. سیاست فروش هر سایت فرق داره. مشاهده رایگان ویدئو ها هم با این شرطه که توی یوتیوب دیده بشه. همچنین فایل ها و سورس کد های آموزش رو هم توی یوتوب نذاشتم و اگر کسی بخواد باید آموزش رو بخره. آموزش رو از طریق Playlist زیر می‌تونید مشاهده کنید :<\/p>\n\n\n\n<p class=\"has-text-align-left\"><a href=\"https:\/\/www.youtube.com\/playlist?list=PLoUfrSM-MrR3iFQZiyRgOiYri5D9RE6ux\">https:\/\/www.youtube.com\/playlist?list=PLoUfrSM-MrR3iFQZiyRgOiYri5D9RE6ux<\/a><\/p>\n\n\n\n<p>حالا چرا آموزش سی‌شارپ رو نذاشتم؟ از آموزش سی‌شارپ راضی نیستم. قدیمی هم شده. البته برای مباحث پایه‌ای هنوز می‌تونه کمک کنه ولی اگر اهل خوندن کتاب هستید توصیه میکنم کتاب سی‌شارپ سایت w3-farsi.com رو بگیرید.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>من ضبط فیلم های آموزشی رو از سال سوم دبیرستان شروع کردم. یکی از آشناها گیر داده بود که بیا به من کار با کامپیوتر&#8230;<\/p>\n","protected":false},"author":1,"featured_media":891,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[38],"tags":[],"class_list":["post-887","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-38"],"_links":{"self":[{"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/posts\/887"}],"collection":[{"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/comments?post=887"}],"version-history":[{"count":2,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/posts\/887\/revisions"}],"predecessor-version":[{"id":1457,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/posts\/887\/revisions\/1457"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/media\/891"}],"wp:attachment":[{"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/media?parent=887"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/categories?post=887"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/127.0.0.1\/blog\/wp-json\/wp\/v2\/tags?post=887"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}